Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиТуров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительноеСоглашение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчастников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПоездки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутПоездки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГородаМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гостиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНомеровГостиниц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПродажиТуров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиТуров</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУчастников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКлиентами</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Договор/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Автоматически заполняем валюту по соглашению
	Если ЗначениеЗаполнено(Соглашение) Тогда
		СоглашениеОбъект = Соглашение.ПолучитьОбъект();
		Если СоглашениеОбъект.ГородаПосещения.Количество() > 0 Тогда
			ПерваяСтрока = СоглашениеОбъект.ГородаПосещения.Получить(0);
			Если ЗначениеЗаполнено(ПерваяСтрока.Город) Тогда
				Валюта = ПерваяСтрока.Город.Валюта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверки обязательных полей
	Если Организация = Неопределено Тогда
		Сообщить("Заполните организацию!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Клиент = Неопределено Тогда
		Сообщить("Заполните клиента!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СтранаПосещения = Неопределено Тогда
		Сообщить("Заполните страну посещения!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НачалоПоездки = '00010101' Тогда
		Сообщить("Заполните начало поездки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ОкончаниеПоездки = '00010101' Тогда
		Сообщить("Заполните окончание поездки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если КоличествоУчастников <= 0 Тогда
		Сообщить("Укажите количество участников поездки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если УчастникиПоездки.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы одного участника!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если МаршрутПоездки.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы один город в маршрут!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Валюта = Неопределено Или Не ЗначениеЗаполнено(Валюта) Тогда
		Сообщить("Выберите валюту!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Регистр "ПродажиТуров" - фиксируем продажу
	Движения.ПродажиТуров.Записывать = Истина;
	Движение = Движения.ПродажиТуров.Добавить();
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
	Движение.Страна = СтранаПосещения;
	Движение.Агент = Агент;
	Движение.Клиент = Клиент;
	Движение.Сумма = Сумма;
	Движение.КоличествоУчастников = КоличествоУчастников;
	Движение.Валюта = Валюта;
	
	// 2. Регистр "ВзаиморасчетыСКлиентами" - фиксируем задолженность
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	ДвижениеРасчет = Движения.ВзаиморасчетыСКлиентами.Добавить();
	ДвижениеРасчет.Период = Дата;
	ДвижениеРасчет.Договор = Ссылка;
	ДвижениеРасчет.Клиент = Клиент;
	ДвижениеРасчет.СуммаОплаты = 0;
	ДвижениеРасчет.СуммаЗадолженности = Сумма;

	Сообщить("✅ Документ " + Ссылка.Номер + " успешно проведен! Сумма: " + Сумма);
	
КонецПроцедуры

Процедура ОбработкаОтменыПроведения(Отказ, РежимОтменыПроведения)
	
	Движения.ПродажиТуров.Записывать = Истина;
	Движения.ПродажиТуров.Очистить();
	
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКлиентами.Очистить();
	
	Сообщить("⛔ Проведение документа " + Ссылка.Номер + " отменено!");
	
КонецПроцедуры

// Главная экспортная функция, вызываемая из формы документа
Функция Печать(МассивОбъектов = Неопределено) Экспорт

	Если МассивОбъектов = Неопределено Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Ссылка);
	КонецЕсли;
	
	Возврат ПечатьДоговора(МассивОбъектов);
	
КонецФункции

// Внутренняя функция формирования табличного документа по макету
Функция ПечатьДоговора(МассивОбъектов)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПечатнаяФорма";
	
	// Получаем макет из метаданных документа. 
	// Если ваш макет в конфигураторе называется иначе (например, "ПечатнаяФорма"), измените имя в скобках!
	Макет = ПолучитьМакет("ПечатнаяФорма"); 
	
	// Получаем именованные области строк макета
	ОбластьШапка    = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные   = Макет.ПолучитьОбласть("Данные");
	ОбластьДанныеТЧ = Макет.ПолучитьОбласть("ДанныеТЧ");
	ОбластьМаршрут  = Макет.ПолучитьОбласть("Маршрут");
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
	
	Для каждого ТекДокумент Из МассивОбъектов Цикл
		
		ДокОбъект = ТекДокумент.ПолучитьОбъект();
		
		// 1. Заполняем шаблон области "Шапка"
		// В макете используется тип "Шаблон": ДОГОВОР № [НомерДоговора] от [ДатаДоговора]
		ОбластьШапка.Параметры.НомерДоговора = ДокОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора  = Формат(ДокОбъект.Дата, "ДЛФ=Д");
		ТабДок.Вывести(ОбластьШапка);
		
		// 2. Заполняем параметры области "Данные"
		ОбластьДанные.Параметры.Организация          = ДокОбъект.Организация;
		ОбластьДанные.Параметры.Агент                = ДокОбъект.Агент;
		ОбластьДанные.Параметры.Клиент               = ДокОбъект.Клиент;
		ОбластьДанные.Параметры.Страна               = ДокОбъект.СтранаПосещения;
		ОбластьДанные.Параметры.ДатаПоездки          = Формат(ДокОбъект.НачалоПоездки, "ДЛФ=Д"); 
		ОбластьДанные.Параметры.КоличествоУчастников = ДокОбъект.КоличествоУчастников;
		ОбластьДанные.Параметры.Сумма                = ДокОбъект.Сумма;
		ОбластьДанные.Параметры.Валюта               = ДокОбъект.Валюта;
		ТабДок.Вывести(ОбластьДанные);
		
		// 3. Выводим статичную шапку таблицы (Заголовок "Маршрут поездки" и имена колонок)
		ТабДок.Вывести(ОбластьДанныеТЧ);
		
		// 4. Заполняем строки таблицы "МаршрутПоездки" в цикле
		НомерСтроки = 1;
		Для каждого СтрокаМаршрута Из ДокОбъект.МаршрутПоездки Цикл
			
			ОбластьМаршрут.Параметры.Номер         = НомерСтроки;
			ОбластьМаршрут.Параметры.Город         = СтрокаМаршрута.Город;
			ОбластьМаршрут.Параметры.Гостиница         = СтрокаМаршрута.Гостиница;
			ОбластьМаршрут.Параметры.ВидНомера     = СтрокаМаршрута.ВидНомера;
			ОбластьМаршрут.Параметры.ДатаНачала    = Формат(СтрокаМаршрута.ДатаНачала, "ДЛФ=Д");
			ОбластьМаршрут.Параметры.ДатаОкончания = Формат(СтрокаМаршрута.ДатаОкончания, "ДЛФ=Д");
			
			ТабДок.Вывести(ОбластьМаршрут);
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		// 5. Заполняем и выводим область "Подвал" с подписями сторон
		ОбластьПодвал.Параметры.Руководитель = "Директор ООО ""Мечта путешественника"""; 
		ОбластьПодвал.Параметры.Клиент       = ДокОбъект.Клиент;
		ТабДок.Вывести(ОбластьПодвал);
		
		// Если печатается несколько документов сразу — разделяем их страницами
		Если МассивОбъектов.Найти(ТекДокумент) < МассивОбъектов.Количество() - 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
